Tekla Open API Reference for Tekla Structures 2025
RebarHookDataNullable.Shape Property
 Gets or sets the shape of the hook. The options are:
NO_HOOK. Sets the angle, radius and length to 0.
HOOK_90_DEGREES.
HOOK_135_DEGREES.
HOOK_180_DEGREES.
CUSTOM_HOOK. The angle, radius and length values have to be set manually.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarHookData.RebarHookShapeEnum? Shape { get; set; }
Public Property Shape As RebarHookData.RebarHookShapeEnum?
	Get
	Set
Property Value
Type: Nullable<RebarHookData.RebarHookShapeEnum>
See Also
Reference
RebarHookDataNullable Class
Tekla.Structures.Model Namespace